Revit 2027 API
TilePatterns Methods
The TilePatterns type exposes the following members.
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTilePattern |  Retrieve a TilePattern object from a built-in type.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
TilePatterns Class
Autodesk.Revit.DB Namespace